<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of BBEdit and makes a pkg of it then uploads it to the JSS.</string>
	<key>Identifier</key>
	<string>com.meissa.jss.BBEdit</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>AutoPkgr Apps</string>
    		<key>skip_scope</key>
   		<true/>
		<key>NAME</key>
		<string>BBEdit</string>
		<key>POLICY_CATEGORY</key>
		<string>AutoPkgr Apps</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>BBEdit is the leading professional HTML and text editor for the Mac.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>BBEdit.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.BBEdit</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
