<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.meissa.jss.GoogleDriveFileStream</string>
	<key>Description</key>
	<string>Downloads the latest version of Drive File Stream, creates a package, and uploads to the JSS.</string>
	<key>Input</key>
	<dict>
		<key>skip_scope</key>
		<true/>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>%CATEGORY%</string>
		<key>AutoPkgr Apps</key>
		<string>Product of AutoPkg</string>
		<key>NAME</key>
		<string>Google Drive File Stream</string>
		<key>CATEGORY</key>
		<string>AutoPkgr Apps</string>
		<key>DESCRIPTION</key>
		<string>With Drive File Stream, you stream your Drive files directly from the cloud to your Mac or PC, freeing up disk space and network bandwidth.  Because Drive files are stored in the cloud, any changes you or your collaborators make are automatically updated everywhere, so you’ll always have the latest version.  You can also make Drive files available for offline access.  These cached files sync to the cloud and all your devices when you're back online.

With Drive File Stream, you can:
  * Quickly see all your Google Drive files in Finder/Explorer (including Team Drives).
  * Browse and organize Google Drive files without downloading all of them to your computer.
  * Choose which files or folders you'd like to make available offline.
  * Open files in common apps like Microsoft Office and Adobe Photoshop.

Drive File Stream is only usable with G-Suite accounts.</string>
		<key>ICON</key>
		<string>%RECIPE_DIR%/GoogleDriveFileStream.png</string>
		<key>os_requirements</key>
		<string>10.13.x,10.12.x,10.11.x</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.meissa.pkg.GoogleDriveFileStream</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_icon</key>
				<string>%ICON%</string>
				<key>self_service_description</key>
				<string>%DESCRIPTION%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
