<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Slack and makes a pkg of it Then, uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.meissa.jss.Slack</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>AutoPkg Apps</string>
    		<key>skip_scope</key>
   		<true/>
		<key>NAME</key>
		<string>Slack</string>
		<key>POLICY_CATEGORY</key>
		<string>AutoPkg Apps</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Slack is a platform for team communication: everything in one place, instantly searchable, available wherever you go.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Slack.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.meissa.pkg.slack</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
