<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Zoom for IT Admins package.  For customizing the package (i.e. SSO, etc).</string>
	<key>Identifier</key>
	<string>com.meissa.download.Zoom-IT-Installer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Zoom</string>
		<key>DOWNLOAD_URL</key>
		<string>https://zoom.us/client/latest/ZoomInstallerIT.pkg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>exepected_authority_names</key>
					<array>
						<string>Developer ID Installer: Zoom Video Communications, Inc.</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
