<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Adobe Acrobat Reader DC and makes a pkg of it then uploads it to the JSS.</string>
	<key>Identifier</key>
	<string>com.meissa.jss.AdobeReaderDC</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>AutoPkgr Apps</string>
		<key>skip_scope</key>
		<true/>
		<key>NAME</key>
		<string>Adobe Acrobat Reader DC</string>
		<key>OS_REQUIREMENTS</key>
		<string>10.15.x,10.14.x,10.13.x,10.12.x</string>
		<key>POLICY_CATEGORY</key>
		<string>AutoPkgr Apps</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.AdobeReaderDC</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
					</dict>
				</array>
				<key>os_requirements</key>
				<string>%OS_REQUIREMENTS%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
